##
## Strongly Recommended
##
## Not necessarily required for functionality, but unclear if things will work
## without these upgrades
##

# CLI formulas migrated to nix (see nix/profiles/all/cli-tools.nix).
# Casks, mas, and taps remain here until the nix-darwin slice migrates them.
# NOTE: brew 'watchman' retained here because watchman's folly C++ dep fails to
# build on aarch64-darwin with the current nixpkgs version.
# Re-evaluate on next nixpkgs bump.
brew 'watchman'

##
## AWS Tools
##

cask 'aws-vault'

##
## User
##
## Put your packages here
##

cask '1password'
cask '1password-cli'
cask 'docker'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'fork'
cask 'firefox'
cask 'gitup'
cask 'gpg-suite'
cask 'grandperspective'
cask 'ngrok'
cask 'obsidian'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'

# Install App Store packages
# for some reason, Keynote, Numbers, and Pages insist on being reinstalled on
# every run, so, for the time being, they've been disabled.
# mas 'Keynote', id: 409_183_694
# mas 'Numbers', id: 409_203_825
# mas 'Pages', id: 409_201_541
mas 'Magnet', id: 441_258_766
mas 'Slack', id: 803_453_959
